# ML1 LAB01
# 16/04/2022

# 21BDA14
# NIKHITHA ELEZEBETH BABY

# PYTHON DATATYPES AND DATASTUCTURES

In [214]:
type(1)

int

In [215]:
type(1.4)

float

In [216]:
type("Hello World!")

str

In [217]:
type(True)

bool

In [218]:
type(10j)

complex

In [219]:
type("!")

str

In [220]:
type([1,4,6,7,8])

list

In [221]:
type((1,4,6,7,8))

tuple

In [222]:
type({'a':10,'b':20,'c':30})

dict

In [223]:
a=[1,2,3]

In [224]:
[a,a]

[[1, 2, 3], [1, 2, 3]]

In [225]:
""

''

In [226]:
None

In [227]:
1+1

2

In [228]:
"1"+"1"

'11'

Indexing

In [229]:
list1=[1,2,3,4]

In [230]:
list1[1]

2

In [231]:
list2=['Ann','Sandra','Ram']

In [232]:
list2[2]

'Ram'

In [233]:
list2[0]

'Ann'

In [234]:
list2[0]+list2[1]

'AnnSandra'

Loops and Iterations

In [235]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [236]:
marks=[60,20,65,90,87,54]

In [237]:
marks[2]

65

In [238]:
for mark in marks:
    print(mark)

60
20
65
90
87
54

In [239]:
for mark in range(len(marks)):
    print(marks[mark])

60
20
65
90
87
54

if-else statements

In [240]:
if "Ann" in list2:
    print("True")
else:
    print("False")

True

Functions

In [241]:
def sum(a,b):
    return a+b

In [242]:
sum(1,2)

3

In [243]:
def diff(c = 0,d = 0):
    print(c)
    return c-d

In [244]:
diff(c = 10,d = 5)

10

5

In [245]:
diff(10)

10

10

In [246]:
c

NameError: name 'c' is not defined

Python for datascience

In [264]:
import pandas as pd
import numpy as np

In [265]:
marks

[60, 20, 65, 90, 87, 54]

In [266]:
marks_Series = pd.Series(marks)

In [267]:
marks_Series

0    60
1    20
2    65
3    90
4    87
5    54
dtype: int64

In [268]:
marks_Series.index

RangeIndex(start=0, stop=6, step=1)

In [269]:
marks_Series.values

array([60, 20, 65, 90, 87, 54], dtype=int64)

In [270]:
marks_Series[2:]

2    65
3    90
4    87
5    54
dtype: int64

In [271]:
marks_Series[:3]

0    60
1    20
2    65
dtype: int64

In [272]:
marks_Series[3]=None

In [273]:
marks_Series

0    60.0
1    20.0
2    65.0
3     NaN
4    87.0
5    54.0
dtype: float64

In [274]:
marks_Series.value_counts()

65.0    1
54.0    1
20.0    1
87.0    1
60.0    1
dtype: int64

In [275]:
df=pd.DataFrame([marks,marks]).T

In [276]:
df

    0   1
0  60  60
1  20  20
2  65  65
3  90  90
4  87  87
5  54  54

In [277]:
df.columns=['mark1','mark2']

In [278]:
df

   mark1  mark2
0     60     60
1     20     20
2     65     65
3     90     90
4     87     87
5     54     54

In [279]:
df1=pd.read_csv("tips.csv")

In [280]:
df1

     table_number  total_bill   tip     sex smoker   day    time  size
0               3       16.99  1.01  Female     No   Sun  Dinner     2
1               6       10.34  1.66    Male     No   Sun  Dinner     3
2              16       21.01  3.50    Male     No   Sun  Dinner     3
3              12       23.68  3.31    Male     No   Sun  Dinner     2
4               2       24.59  3.61  Female     No   Sun  Dinner     4
..            ...         ...   ...     ...    ...   ...     ...   ...
239             9       29.03  5.92    Male     No   Sat  Dinner     3
240             4       27.18  2.00  Female    Yes   Sat  Dinner     2
241             5       22.67  2.00    Male    Yes   Sat  Dinner     2
242             4       17.82  1.75    Male     No   Sat  Dinner     2
243             1       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 8 columns]

In [281]:
df1.head()

   table_number  total_bill   tip     sex smoker  day    time  size
0             3       16.99  1.01  Female     No  Sun  Dinner     2
1             6       10.34  1.66    Male     No  Sun  Dinner     3
2            16       21.01  3.50    Male     No  Sun  Dinner     3
3            12       23.68  3.31    Male     No  Sun  Dinner     2
4             2       24.59  3.61  Female     No  Sun  Dinner     4

In [282]:
df1.tail()

     table_number  total_bill   tip     sex smoker   day    time  size
239             9       29.03  5.92    Male     No   Sat  Dinner     3
240             4       27.18  2.00  Female    Yes   Sat  Dinner     2
241             5       22.67  2.00    Male    Yes   Sat  Dinner     2
242             4       17.82  1.75    Male     No   Sat  Dinner     2
243             1       18.78  3.00  Female     No  Thur  Dinner     2

In [283]:
df1.shape

(244, 8)

In [284]:
df1['day']

0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day, Length: 244, dtype: object

In [285]:
type(df1['day'])

pandas.core.series.Series

In [286]:
type(df1)

pandas.core.frame.DataFrame

In [287]:
df1['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [288]:
df1.isna().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of      table_number  total_bill    tip    sex  smoker    day   time   size
0           False       False  False  False   False  False  False  False
1           False       False  False  False   False  False  False  False
2           False       False  False  False   False  False  False  False
3           False       False  False  False   False  False  False  False
4           False       False  False  False   False  False  False  False
..            ...         ...    ...    ...     ...    ...    ...    ...
239         False       False  False  False   False  False  False  False
240         False       False  False  False   False  False  False  False
241         False       False  False  False   False  False  False  False
242         False       False  False  False   False  False  False  False
243         False       False  False  False   False  False  False  False

[244 rows x 8 columns]>

In [289]:
df1.describe()

       table_number  total_bill         tip        size
count    244.000000  244.000000  244.000000  244.000000
mean       8.561475   19.785943    2.998279    2.569672
std        4.583957    8.902412    1.383638    0.951100
min        1.000000    3.070000    1.000000    1.000000
25%        4.000000   13.347500    2.000000    2.000000
50%        9.000000   17.795000    2.900000    2.000000
75%       12.000000   24.127500    3.562500    3.000000
max       16.000000   50.810000   10.000000    6.000000

In [290]:
df1.corr()

              table_number  total_bill       tip      size
table_number      1.000000   -0.042828 -0.091144  0.005621
total_bill       -0.042828    1.000000  0.675734  0.598315
tip              -0.091144    0.675734  1.000000  0.489299
size              0.005621    0.598315  0.489299  1.000000